# Rebar Shape Get End Treatment Type Id Method

Source: https://www.revitapidocs.com/2026/d78defed-af7e-8feb-6e71-2c067fcc3397.htm

---

| Rebar Shape Get End Treatment Type Id Method |
| --- |

**Note: This API is now obsolete.**

Gets the id of the EndTreatmentType at the specified rebar shape end.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().EndTreatmentTypeIdAtStart or RebarShape.GetTerminationsData().EndTreatmentTypeIdAtEnd instead.")]
public ElementId GetEndTreatmentTypeId(
	int end
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().EndTreatmentTypeIdAtStart or RebarShape.GetTerminationsData().EndTreatmentTypeIdAtEnd instead.")>
Public Function GetEndTreatmentTypeId (
	end As Integer
) As ElementId
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().EndTreatmentTypeIdAtStart or RebarShape.GetTerminationsData().EndTreatmentTypeIdAtEnd instead.")]
ElementId^ GetEndTreatmentTypeId(
	int end
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().EndTreatmentTypeIdAtStart or RebarShape.GetTerminationsData().EndTreatmentTypeIdAtEnd instead.")>]
member GetEndTreatmentTypeId :
        end : int -> ElementId
```

#### Parameters

end Int32
:   0 for the start end treatment, 1 for the end end treatment.

#### Return Value

ElementId
Returns the id of an EndTreatmentType, or invalidElementId if the rebar shape has no end treatment at the specified end. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | end not a valid shape end |

See Also

#### Reference

RebarShape Class Autodesk.Revit.DB.Structure Namespace